BAS BMEKZU Project/src/InformationRegisters/ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам/ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НомерЛицевогоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарплатныйПроект</name>
    <type>
      <types>CatalogRef.ЗарплатныеПроекты</types>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Банки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеНазначение</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоНаправлениюОргановЗанятости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ГруппаВзносов</name>
    <type>
      <types>CatalogRef.ИНАГРО_ГруппыВзносовВФонды</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ДоговорПодряда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.УдалитьВидыДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Добавление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Удаление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/InformationRegisters/ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаборЗаписей(ЭтотОбъект, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//Проверяет номера лицевых счетов в наборе записей, зарегистрированы они или нет.
//
// Параметры:
//		НаборЗаписей - Набор записей регистра сведений "Лицевые счета сотрудников по зарплатным проектам"
//		Отказ - Если Истина, то запись набора не производится, иначе Ложь
//
Процедура ПроверитьНаборЗаписей(НаборЗаписей, Отказ)
	Если НаборЗаписей.ДополнительныеСвойства.Свойство("ЗагрузкаДанных") = Ложь Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("НаборЗаписей", НаборЗаписей.Выгрузить());
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НаборЗаписей.Организация КАК Организация,
		|	НаборЗаписей.ЗарплатныйПроект КАК ЗарплатныйПроект,
		|	НаборЗаписей.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НаборЗаписей.НомерЛицевогоСчета КАК НомерЛицевогоСчета
		|ПОМЕСТИТЬ ВТНаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛицевыеСчета.Организация КАК Организация,
		|	ЛицевыеСчета.ЗарплатныйПроект КАК ЗарплатныйПроект,
		|	ЛицевыеСчета.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЛицевыеСчета.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
		|	МАКСИМУМ(Сотрудники.Ссылка) КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам КАК ЛицевыеСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНаборЗаписей КАК НаборЗаписей
		|		ПО ЛицевыеСчета.Организация = НаборЗаписей.Организация
		|			И ЛицевыеСчета.ЗарплатныйПроект = НаборЗаписей.ЗарплатныйПроект
		|			И ЛицевыеСчета.НомерЛицевогоСчета = НаборЗаписей.НомерЛицевогоСчета
		|			И ЛицевыеСчета.ФизическоеЛицо <> НаборЗаписей.ФизическоеЛицо
		|			И ЛицевыеСчета.НомерЛицевогоСчета <> """"
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО ЛицевыеСчета.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
		|			И ЛицевыеСчета.Организация = Сотрудники.ГоловнаяОрганизация
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицевыеСчета.Организация,
		|	ЛицевыеСчета.ЗарплатныйПроект,
		|	ЛицевыеСчета.ФизическоеЛицо,
		|	ЛицевыеСчета.НомерЛицевогоСчета";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='Обнаружен сотрудник с точно таким же номером лицевого счета - %1.';uk='Виявлений співробітник з точно таким же номером особового рахунку - %1.'"),
						Выборка.ФизическоеЛицо);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Выборка.Сотрудник, , , Отказ);
			КонецЦикла;
			
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
